[
  {
    "Tweet": "@gobidad11 He is going for a coveted \"trump university fellowship\"."
  },
  {
    "Tweet": " Oakland University Athletics is excited to announce the Hollie L. Lepley Hall of Honor Class of 2020!"
  },
  {
    "Tweet": " Rwanda is building its own Silicon Valley in partnership with Carnegie Mellon University. It is called Kigali Innovati"
  },
  {
    "Tweet": "@UrbaniteAlaska Gohmert has a law degree from Baylor University, which is ranked 48th in the country as law schools go. Harvard and Stanford are ranked second and third. Hes a putz!"
  },
  {
    "Tweet": " Blessed to receive an offer from Stetson University  @CoachJJPerk @GatorsPbg @StetsonU "
  },
  {
    "Tweet": " Boise State STUD Curtis Weaver can't get the image of how last season ended out of his head."
  },
  {
    "Tweet": " I am blessed and honored to receive a scholarship offer from the University of Houston @Doug_Belk @DaveHenigan @CoachDeLaT"
  },
  {
    "Tweet": " Wow is #PamelaKarlan a bitter angry woman....and she is prostituting herself in front of her students, her university and th"
  },
  {
    "Tweet": " Blessed to receive an offer from St. Andrews University!! @YorkRecruits @Coach_AjHopke @YorkCougars "
  },
  {
    "Tweet": " BLESSED to receive an offer(PWO) from North Carolina State University@CoachGoebbel  @cferdinand_21 @RecruitSPHS"
  },
  {
    "Tweet": " @Avenger2Toxic @Ed08792346 My daughter is attending a very leftist university and studying to be a teacher.  She loved Bern"
  },
  {
    "Tweet": "@DevinCow Trump University must have had a law school, I guess."
  },
  {
    "Tweet": " Extremely blessed to have received an offer from Duke University!!@DavidCutcliffe @CoachJimBridge @dukecoachdj"
  },
  {
    "Tweet": " Having taught university students for twenty years, I would say to parents, the most important thing you can teach your c"
  },
  {
    "Tweet": "@liber0perfavore Thats right you guessed it ... Just a BSME and a MME from The Ohio State University Middle School.. If you had actually read my profile you would have seen that though ... Haters like you aren't even worth my time .."
  },
  {
    "Tweet": " Congrats to Xi Chapter (Indiana University-Purdue University Indianapolis) on founding the university's 1st Multicultural Gr"
  },
  {
    "Tweet": " Proud to provide #software that facilitates learning and supports the growth of award-winning educational institutions like"
  },
  {
    "Tweet": "@TrueQanuck11 @PConnie1776 This is a typical university professor no wonder our kids graduate dumber than when the started"
  },
  {
    "Tweet": " Extremely blessed to have received an offer from Duke University!!@DavidCutcliffe @CoachJimBridge @dukecoachdj"
  },
  {
    "Tweet": " Blessed to recieve a offer from The Arkansas State university @CoachJdbs @AStateFB "
  },
  {
    "Tweet": " @AviWoolf Avi, you are absolutely correct. Conservatives shouldnt abandon universities. The popularity of ideas ebbs a"
  },
  {
    "Tweet": " This is university in a tweet "
  },
  {
    "Tweet": " Truly BLESSED to receive a scholarship offer from Elon University!!! @TonyTrisciani @Coach_TLucas @bigplay_clay "
  },
  {
    "Tweet": " Blessed to announce I have recieved another offer to play at Concordia University @CoachWatkinsCUC #gocougars "
  },
  {
    "Tweet": " President Buhari advises parents to withdraw kids from schools abroad ~Pulse Ng 6/3/2016Where Buhari's children schooled:F"
  },
  {
    "Tweet": " If anyone would like to call George Washington University and ask for Jonathan Turley termination call 202-994-1010 and"
  },
  {
    "Tweet": " I cannot be more proud and happy to announce that I am an Illini and have committed to run xc and track at the Universi"
  },
  {
    "Tweet": " Wow is #PamelaKarlan a bitter angry woman....and she is prostituting herself in front of her students, her university and th"
  },
  {
    "Tweet": " Just hearing from a student who says that as a result of being involved in the strikes, he feels more involved in the unive"
  },
  {
    "Tweet": " This is a harrowing story. Its the story of how protests in Hong Kong escalated into an all-out battle between demonstra"
  },
  {
    "Tweet": " I would rather be governed by the first 2,000 people in the telephone directory than by the Harvard University faculty"
  },
  {
    "Tweet": " Blessed to receive an offer from Rice university #TheRiceWay @RiceBasketball  .......#stayclutch "
  },
  {
    "Tweet": "@narendramodi Yeh  kainsa Uttar Pradesh;where in girls hostel  of University parents permission is not necessary,Girl child is allowed to leave hostel without permission of parents in evening. Sharda University Gr.Noida is one such.Request sent for high level inquiry,action toPMO"
  },
  {
    "Tweet": "Keep on keeping on with your allegiance to trump and not to our Country or your University. "
  },
  {
    "Tweet": " @bbcnickrobinson To paraphrase Noam Chomsky, if Nick Robinson hadn't been President of the Oxford University Conservat"
  },
  {
    "Tweet": " So thankful to receive an offer from the University of Nebraska !!! #GBR  @EDGYTIM @ThrowItDeep @247Sports "
  },
  {
    "Tweet": " After a good talk with Coach Seiler Im extremely glad to say I received an offer from West Virginia University !!!! @Coach_"
  },
  {
    "Tweet": " @winlow_s @A4587GA @culturalcrim @James_Treadwell @ProfDavidWilson These are vile and hurtful opinions to all of us within th"
  },
  {
    "Tweet": " I'm alive if someone is wonderingbut not for longuniversity will kill me someday  "
  },
  {
    "Tweet": "Opening arguments were heard in the case of a former University of Maryland football playercharged with raping a woman at a local hotel in 2017. "
  },
  {
    "Tweet": " Congrats to Arika Buxton of 2002 Elite on her verbal commitment to Lindenwood University!!  We are so proud of your acc"
  },
  {
    "Tweet": " Natalie Portman studied Psychology at Harvard University and co-authored under birth name Hershlag a research study of"
  },
  {
    "Tweet": " Today we remember Hannah Cornelius. A university student whose future was ripped away by woman abuse. Remembering is not"
  },
  {
    "Tweet": "Don't Go to Webster University for a Game Design Degree  #univeristy #universitycorruption #formerstudent #whatascam"
  },
  {
    "Tweet": "Dr. Martin Greenhow in Brunel University London wrote an email to stand with Xinjiang Uighur "
  },
  {
    "Tweet": " A new science-led partnership with @MassiveAttackUK is seeking to map music industry's carbon impact. @TyndallCentre "
  },
  {
    "Tweet": " Look at that! ONE UNIVERSITY ONE WORKFORCE "
  },
  {
    "Tweet": " When I emigrated from Soviet Union to the West in 1998, I was enormously proud to get into the top University: Cambridge."
  },
  {
    "Tweet": " Delighted with the news that @DublinCityUni has maintained its position as #12 in the world for Sustainability in the 2"
  },
  {
    "Tweet": "From article: \"The sheer number of spills in the past several years is striking. All told, the Duke University researchers mapped out a total of more than 3,900 accidental spills of oil and gas wastewater in North Dakota alone.\""
  },
  {
    "Tweet": "ClickBank University "
  },
  {
    "Tweet": " My big-picture column on Gophers football after 10-2 season. Wisconsin loss was disappointing b/c of what was at stake, b"
  },
  {
    "Tweet": " The University of Kansas @KUHoops  was in the gym this afternoon, attending our high school team's practice. We appreciate"
  },
  {
    "Tweet": " The University of Regina Conservatory of Performing Arts and Regina Community Radio are proud to present PODCASTING AND RAD"
  },
  {
    "Tweet": "@AviWoolf Avi, you are absolutely correct. Conservatives shouldnt abandon universities. The popularity of ideas ebbs and flows but abandoning the university would simply demonstrate that conservatives are spineless snowflakes who dont have the backbone to fight for what we believe in."
  },
  {
    "Tweet": " Rwanda is building its own Silicon Valley in partnership with Carnegie Mellon University. It is called Kigali Innovati"
  },
  {
    "Tweet": "@RattlerGator Members of the 1920 Gallaudet University football team. The first college for the deaf is credited with inventing the football huddle to keep the opposing team from seeing them calling the plays in sign language."
  },
  {
    "Tweet": " Harvard Universitys denial of tenure to the only Latina professor on track for the status sparks student protests and calls f"
  },
  {
    "Tweet": "@NolamadwomanG @mkraju Ok we will send them TRUMP INTERNATIONAL UNIVERSITY."
  },
  {
    "Tweet": " @RiegerReport Aww, you want to go Trump University??"
  },
  {
    "Tweet": "University of Colorado Boulder: Stop using live animal mascots at sporting events! - Firma la petizione!  via @ChangeItalia"
  },
  {
    "Tweet": "@PMOIndia Yeh  kainsa Uttar Pradesh;where in girls hostel  of University parents permission is not necessary,Girl child is allowed to leave hostel without permission of parents in evening. Sharda University Gr.Noida is one such.Request sent for high level inquiry,action to PMO"
  },
  {
    "Tweet": "@AscendedAncient Yeah, the masterclass was held at my University's theatre room. We saw a few Game of Thrones clips and Justice League Trailers there too "
  },
  {
    "Tweet": " Yesterday, I sent a letter to FL university presidents requesting info on the steps taken to safeguard Americans tech &amp;"
  },
  {
    "Tweet": " Hey guys, usually I don't ask for favors but I'm involved in a nonprofit organization at Michigan State University by"
  },
  {
    "Tweet": " BLESSED to receive an offer(PWO) from North Carolina State University@CoachGoebbel  @cferdinand_21 @RecruitSPHS"
  },
  {
    "Tweet": " After a great talk with @Coach68Hinojos I am blessed to receive my first official offer from Wayland Baptist university"
  },
  {
    "Tweet": "@LeftieK13 @JamesCleverly @JonAshworth @IBlackfordSNP @EdwardJDavey @TiceRichard 163 university lecturers doing the usual rounds for Labour! I wonder why?The IFS said it was \"simply not credible\" and would \"affect individuals\". The article below is worth a read too."
  },
  {
    "Tweet": "I highly doubt Melania is multilingual. Her CV is obviously a lie; it allowed an immigrant to enter this country. She also lied about attending a university in her country. "
  },
  {
    "Tweet": "@MTBlack2567 Wizards. A huge college of wizards. It never learned to read so it thought wizards could teach them verbally. It grew into the single largest university of arcane learning the multiverse has ever known."
  },
  {
    "Tweet": " If youre interested in a career working at a university in residence or student life, career coaching, academic advising,"
  },
  {
    "Tweet": "Ive been wanting to make this account for the looongest time but university would not allow me to BREATHE it still doesnt but i really need somewhere to cry over how adorable litol seungminnie is "
  },
  {
    "Tweet": " @SaraCarterDC @ciaobella50 @POTUS You know whats really disgusting? Women who stick up for men who say, you can grab em by"
  },
  {
    "Tweet": " We are seeking a Postdoc in microbial bioinformatics to contribute to a range of exciting projects at the University of"
  },
  {
    "Tweet": " Rashod Bateman and Tyler Johnson both named First Team All-Big Ten for coaches and media. First time in conference histor"
  },
  {
    "Tweet": "Because he's a Trump University kind of guy, not a constitutional education kind of guy. "
  },
  {
    "Tweet": " Pr. Paul Rohde is retiring at the end of January after serving @AugieChapel for more than 18 years. A blessing was held wi"
  },
  {
    "Tweet": " Wow is #PamelaKarlan a bitter angry woman....and she is prostituting herself in front of her students, her university and th"
  },
  {
    "Tweet": " Thankful to receive an offer to play for Stanford University! Thank you @Coach_Diron for coming up to Blair today. @gb"
  },
  {
    "Tweet": " Very interesting design focus at the University of Virginia - read \"New Contemplative Commons will Enable Collaboration,"
  },
  {
    "Tweet": " I was hazed by Minister Stephen Lecce while I was pledging Sigma Chi at Western University and he was not only fraternity"
  },
  {
    "Tweet": "@WestWingReport A lot of people think if a person wants to attend a college or university they should attend somewhere within an hours driving distance of their families residence."
  },
  {
    "Tweet": "@GCtheNorthKing Yeah I thought that was so bizarre and condescending... like really you can still be well informed about a subject without having stepped into a university lecture room"
  },
  {
    "Tweet": " Especially on the campus of Bethune-Cookman University! "
  },
  {
    "Tweet": " Congratulations to 2022 grad Ryland Urbancyzk on your commitment to Rice University! @rylo_5 @RiceBaseball #Twelve2022"
  },
  {
    "Tweet": " To the university staff adamantine in their opposition who quite rightly find it morally contestable and academically unac"
  },
  {
    "Tweet": " Senate Confirms 49-44 Pro-Life Trump Nominee Sarah Pitlyk as Federal Judge: Pitlyk served as law clerk to Judge Brett Kavanaugh"
  },
  {
    "Tweet": " UK University income is higher than ever, but staff pay is falling in real terms and #USS pension contributions rising"
  },
  {
    "Tweet": "Linen Postcard, Purdue University, Lafayette, Indiana, Fowler  by lotsofpostcards  via @Etsy"
  },
  {
    "Tweet": "Yeh  kainsa Uttar Pradesh;where in girls hostel  of University parents permission is not necessary,Girl child is allowed to leave hostel without permission of parents in evening. Sharda University Gr.Noida is one such.Request sent for high level inquiry,action to PMO"
  },
  {
    "Tweet": "We have rescheduled the #MC_Raptors basketball vs WVA Potomac State College games for tomorrow, Nov. 5 at Washington Adventist University. The womens game will tip-off at 5 pm &amp; mens game at 7 pm. "
  },
  {
    "Tweet": " Speaking during a House Judiciary Committee hearing Wednesday morning, George Washington University Law Professor Jonathan"
  },
  {
    "Tweet": "BYU = Baby Yoda University"
  },
  {
    "Tweet": " Stanford, Harvard, and University of North Carolina not looking so good today...  #ImpeachmentInquiry"
  },
  {
    "Tweet": " To me, the best education is the one that helps us find and grow our talents in a way that fills us with joy. Thats wh"
  },
  {
    "Tweet": " The University of Illinois at Chicago has increased security on campus following the brutal murder of a student."
  },
  {
    "Tweet": " A group of ladies visiting Cranfield university, stopped to peruse an anxient Greek map on the university wall. I wish"
  },
  {
    "Tweet": " Yes, because who wants to attend a world-class university? "
  },
  {
    "Tweet": " Harvard Universitys denial of tenure to the only Latina professor on track for the status sparks student protests and calls f"
  },
  {
    "Tweet": " Blessed to receive my first Division 1 offer from Mississippi Valley State University #AGTG "
  },
  {
    "Tweet": " During the Popeyes chicken craze discourse so many ppl incorrectly said blk ppl dont patronize blk businesses similarly, whi"
  },
  {
    "Tweet": "@atrupar He must prefer Trump University...."
  },
  {
    "Tweet": " So excited to announce that I will be continuing my education and softball career at Missouri State University! So thankful"
  },
  {
    "Tweet": " Blessed To Receive An Offer From Nebraksa University  #GoHuskers @TBTurner813 @destiny01xx @HuskerFBNation @TeamTampa"
  },
  {
    "Tweet": " George Washington University Law School Prof. Jonathan Turley:\"This would be the first impeachment in history where t"
  },
  {
    "Tweet": " Thankful to receive a basketball scholarship offer from the University of Georgia #GoDawgs @UGA_WBB "
  },
  {
    "Tweet": " Last year I went on 5 holidays and next year I plan on going on 10I afforded it all on a part time wage whilst still on uni"
  },
  {
    "Tweet": " @BryonnyM @RepMarkMeadows @TheRISEofROD Yes i will ... time to email the university and her department and that nerd Feldman n"
  },
  {
    "Tweet": " University of Colorado Boulder: Stop using live animal mascots at sporting events!  via @Change"
  },
  {
    "Tweet": " Excited to announce Ive received my 2nd offer from Aurora University! #GoSpartans "
  },
  {
    "Tweet": "It takes a lot of professionals to run a university...not just faculty!"
  },
  {
    "Tweet": " Blessed to have receive an offer from the university of Nebraska  @AllenTrieu @rivalsmike @EDGYTIM  @HuskerFBNation"
  },
  {
    "Tweet": " Senate Confirms 49-44 Pro-Life Trump Nominee Sarah Pitlyk as Federal Judge: Pitlyk served as law clerk to Judge Brett Kavanaugh"
  },
  {
    "Tweet": "@LoLDeadly @HaisaiEmma Lets put it this way. Hes a graduate student in university. Yet he can go to Geneva to give speech at UN, he travel to Washington DC to meet with US politicians, and he stayed in Okinawa for nearly month earlier this year. Not easy financially for full time ...."
  },
  {
    "Tweet": " Senate Confirms 49-44 Pro-Life Trump Nominee Sarah Pitlyk as Federal Judge: Pitlyk served as law clerk to Judge Brett Kavanaugh"
  },
  {
    "Tweet": " LAWEDUCATIONMEDICAL+MORELeading Professionals to help youOUR EXPERIENCEBachelor Juris Doctor BA BS Arts Science"
  },
  {
    "Tweet": "I see a long thread....What was the question for: What is Clemson University "
  },
  {
    "Tweet": "COLLEGE SIGNINGS: Sheehans Dubuc makes it official with D-II Tampa  "
  },
  {
    "Tweet": "Research Assistant Professor (Wellbeing), Hong Kong Baptist University; Kowloon, Hong Kong, ChinaInitial appointment: a fixed-term contract of two to three years commencing March 2020. Re-appointment thereafter subject to mutual agreement."
  },
  {
    "Tweet": " God has been so good to me in my football career! I wanna thank my Family, Coaches, Teammates, and God for this opportu"
  },
  {
    "Tweet": " Howard on Louisville loss: \"This builds character. Its the best way to learn. Sometimes we get punched in the mouth. Ou"
  },
  {
    "Tweet": " Im very thankful and happy to say I have received my 3rd D1 offer from Northern Arizona University. Thank you @E_Thompson92"
  },
  {
    "Tweet": " TITANS WINIU South Bend continues the incredible start to their season with another conference win over Saint Ambrose Univ"
  },
  {
    "Tweet": " If anyone would like to call George Washington University and ask for Jonathan Turley termination call 202-994-1010 and"
  },
  {
    "Tweet": " @bbcnickrobinson To paraphrase Noam Chomsky, if Nick Robinson hadn't been President of the Oxford University Conservat"
  },
  {
    "Tweet": " Last year I went on 5 holidays and next year I plan on going on 10I afforded it all on a part time wage whilst still on uni"
  },
  {
    "Tweet": "Schools with the best #Undergraduate #ComputerEngineering programs:1 MIT2 Carnegie Mellon University3 University of California- Berkeley4 Georgia Institute of Technology5 Stanford University#CollegeEducation #HigherEducation "
  },
  {
    "Tweet": "University of Central Florida - Two photographers presented to students their project about ongoing forced labor in the prison system, at the last lecture of the fall 2019 James Weldon Johnson Lecture Series "
  },
  {
    "Tweet": "It's like someone soaked the University of Oregon's uniforms in Monster Energy Drink and left them out to dry in the Florida sunshine "
  },
  {
    "Tweet": "NEW: Speaker at University of Florida says people use the excuse of being conservative to justify their racism"
  },
  {
    "Tweet": " Blessed to receive an offer from Manchester University!! @MU_SpartanFB @Coach_Ramos @Niceville_FB @FLCoachT @supernole1"
  },
  {
    "Tweet": "Dean of the School of Business Administration - Widener University - Chester, PA  "
  },
  {
    "Tweet": " If anyone would like to call George Washington University and ask for Jonathan Turley termination call 202-994-1010 and"
  },
  {
    "Tweet": " I am proud to announce that I will be furthering my academic and athletic career at Heidelberg University. I would like"
  },
  {
    "Tweet": " JMU Nation, It has been an awesome ride playing and representing for this University! I have been fortunate these past"
  },
  {
    "Tweet": " this pretty much sums up my time in university "
  },
  {
    "Tweet": " Blessed to announce I have recieved another offer to play at Concordia University @CoachWatkinsCUC #gocougars "
  },
  {
    "Tweet": "@ZachJohnsonPGA Sign them, auction them off. All proceeds go to University of Iowa Stead Family Childrens Hospital."
  },
  {
    "Tweet": " What an incredible moment. What dreams are made of and why you come to THE UNIVERSITY OF LOUISVILLE!! "
  },
  {
    "Tweet": "Scientists Test Three Solutions for Cleaning Pesticides Off Produce: The Winner is Clear, Chemical-Free and Surprisingly Cheap |  "
  },
  {
    "Tweet": "@FLOTUS @IvankaTrump Sanford professor Karlan should be fired we send kids to college to study facts not to hear idiot personal opinions. She's a disgrace to the university."
  },
  {
    "Tweet": " \"We don't want more cosmetic changes. We're going to fight till the end.\"- Lyam, a university student from Chile, on the"
  },
  {
    "Tweet": " Harvard Universitys denial of tenure to the only Latina professor on track for the status sparks student protests and calls f"
  },
  {
    "Tweet": " Articles on the Western Civilisation course which dont identify it as a propaganda exercise are dabbling in false neutr"
  },
  {
    "Tweet": " University of #Rochester becomes battleground in #China, #HongKong conflict"
  },
  {
    "Tweet": "The University of Mississippi: Bring Lane Kiffin to Ole Miss - Sign the Petition!  via @Change"
  },
  {
    "Tweet": " Proud to announce my commitment to play Division 1 hockey at the University of Alaska-Anchorage. Thank you to everyone who has"
  },
  {
    "Tweet": " Blessed to have EARNED my FIRST DIVISION ONE SCHOLARSHIP from MOREHEAD STATE UNIVERSITY  AGTA  @CoachBrins @JU"
  },
  {
    "Tweet": "University with entitled fans. "
  },
  {
    "Tweet": "The more time passes, the more I see how deep it runs and the more my wounds healI am so thankful that my experiences witnessing the indoctrination found in University spared my brother @84GojiBoy that hellI am in awe of how much he has grown"
  },
  {
    "Tweet": " Every worker deserves fair wages, good benefits, and protections from sexual harassment. Im proud to stand in solidarity wit"
  },
  {
    "Tweet": " Hanan Buhari graduates with first class degree from UK university.Congrats @jrnaib2  "
  },
  {
    "Tweet": " Senate Confirms 49-44 Pro-Life Trump Nominee Sarah Pitlyk as Federal Judge: Pitlyk served as law clerk to Judge Brett Kavanaugh"
  },
  {
    "Tweet": " Pamela Karlan, a law professor at Stanford University, brought up 13-year-old Barron Trump while testifying in favor of im"
  },
  {
    "Tweet": " This story is WILDICE created a fake university, then: - enticed foreign-born students to attend- charged them money -"
  },
  {
    "Tweet": "@JudgeJeanine @FLOTUS Sweetie did tiny hands give you a honorary degree from trump university?"
  },
  {
    "Tweet": " TCU's @MaxDuggan_10 was an honorable mention for Big 12's offensive freshman of the year. Finished freshman season with 2,"
  },
  {
    "Tweet": " Senate Confirms 49-44 Pro-Life Trump Nominee Sarah Pitlyk as Federal Judge: Pitlyk served as law clerk to Judge Brett Kavanaugh"
  },
  {
    "Tweet": " George Washington University Law School Prof. Jonathan Turley: \"I believe this impeachment not only fails to satisfy the stand"
  },
  {
    "Tweet": "Grateful to receive another offer from Gannon University @ErikRaeburn  #GoldenKnights "
  },
  {
    "Tweet": " A man who has never gone to school may steal from a freight car; but if he has a university education, he may steal the wh"
  },
  {
    "Tweet": "@mkraju No home school them and then send them to Liberty University to keep them ignorant."
  },
  {
    "Tweet": " Every person in the Bible who achieved greatness went through the University of adversity before having success."
  },
  {
    "Tweet": " After a great home visit with Head Coach Nielsen and Coach Paopao, I would like to announce my commitment to the UNIVERSI"
  },
  {
    "Tweet": " Blessed to receive a PWO from Oregon State University! Thank you @JakeCookus for this opportunity. #BTD20 #GoBeavs #Bom"
  },
  {
    "Tweet": "So what I learned by watching Monsters University before Monsters Inc was their college experience was useless and a complete waste, just like  real life."
  },
  {
    "Tweet": " The Bishop Backers invite you to save the date for Winter Community Day 2020,. "
  },
  {
    "Tweet": " I am extremely excited to announce that I will attend Rice University to further my academic and baseball career! Thankful to e"
  },
  {
    "Tweet": " The evil professor from Stanford University  "
  },
  {
    "Tweet": " Yesterday morning I was kidnapped by the men of F-SARS. I am Masters student at the University of Ibadan. I was on my way to"
  },
  {
    "Tweet": " NEWS ALERT: @bellaborb &amp; @katiemaloney have committed to @PSUwIceHockey! Join us in congratulating them on this amazin"
  },
  {
    "Tweet": "If youre interested in a career working at a university in residence or student life, career coaching, academic advising, check out this degree! "
  },
  {
    "Tweet": " I am THRILLED to announce I will be graduating with a Bachelors of Arts in Music from the University of Southern Mississipp"
  },
  {
    "Tweet": " Senate Confirms 49-44 Pro-Life Trump Nominee Sarah Pitlyk as Federal Judge: Pitlyk served as law clerk to Judge Brett Kavanaugh"
  },
  {
    "Tweet": " Last year I went on 5 holidays and next year I plan on going on 10I afforded it all on a part time wage whilst still on uni"
  },
  {
    "Tweet": " George Washington University should be deeply ashamed that Jonathan Turley would sit there and lie to the nation so blatantl"
  },
  {
    "Tweet": " Ya girl is graduatingThank you Morgan State University "
  },
  {
    "Tweet": "The Flower Minotaur by Turgenev Breton. Published by Wolverine University Press."
  },
  {
    "Tweet": " Arizonas Public University System  jeopardized hisp/latinx safety  poured alcohol on islamic center  regarded l"
  },
  {
    "Tweet": " Canada's conservative Reform Party's despise public education &amp; teachers. So they push for home skoolin etc so  Maw &amp; Paw Ke"
  },
  {
    "Tweet": " When I emigrated from Soviet Union to the West in 1998, I was enormously proud to get into the top University: Cambridge."
  },
  {
    "Tweet": " Senate Confirms 49-44 Pro-Life Trump Nominee Sarah Pitlyk as Federal Judge: Pitlyk served as law clerk to Judge Brett Kavanaugh"
  },
  {
    "Tweet": " Congrats to Amber Hochgesang and family on committing to play soccer and attend Marian University! "
  },
  {
    "Tweet": "Like, go read the About page on the You Matter University site and tell me it makes sense :/"
  },
  {
    "Tweet": "Boise State claims three of the Mountain West's five major awards and has 17 make all-conference teams."
  },
  {
    "Tweet": " George Washington University Law School Prof. Jonathan Turley:\"This would be the first impeachment in history where t"
  },
  {
    "Tweet": "Wilberforce University have some pretty dope artist "
  },
  {
    "Tweet": "#NSTlifestyle: Researchers at the University of California San Francisco said the patient had hard-metal pneumoconiosis, typically found in people exposed to metals such as cobalt or tungsten used in tool sharpening or diamond polishing.#Vape #Vaping"
  },
  {
    "Tweet": " Stayed down and I weathered the storm. Sam Houston State University December 13th, 2019| 9:30AMBachelor of Arts in Vict"
  },
  {
    "Tweet": "Washburn University to build new law school #CapFedBestNews"
  },
  {
    "Tweet": " This comment by UEA Tories in response to @CllrMikeSCs post about putting together food bags for families in deprived a"
  },
  {
    "Tweet": " @GSVlabs and University College London are proud to launch the world's first Global Online EdTech Accelerator! "
  },
  {
    "Tweet": " Blessed to announce I have recieved another offer to play at Concordia University @CoachWatkinsCUC #gocougars "
  },
  {
    "Tweet": " JMU Nation, It has been an awesome ride playing and representing for this University! I have been fortunate these past"
  },
  {
    "Tweet": " @GSVlabs and University College London are proud to launch the world's first Global Online EdTech Accelerator! "
  },
  {
    "Tweet": " Blessed to receive and offer from University of Southeast Missouri state@BG_ELAC @CoachRon79 @DrudikJd "
  },
  {
    "Tweet": " Blessed to receive an official offer to the University of the Cumberlands. Thank you @CoachBrightUC and @UCPatriotFball  for"
  },
  {
    "Tweet": "Wake Forest University #WFU @DeaconDining #ThePit asian station - fried burmese tofu with sweet chili sauce#highered #cafeteria #food #harvesttablecg "
  },
  {
    "Tweet": " I would rather be governed by the first 2,000 people in the telephone directory than by the Harvard University faculty"
  },
  {
    "Tweet": "Halftime at University HeightsMount Union 42John Carroll 36#d3hoops"
  },
  {
    "Tweet": "@dcexaminer @1RealLori @RepMattGaetz Who are the idiots who get to sit there making their little laughs and side comments?  I wish he would call them out too!  A bunch of ahole elite liberals that think theyre smarter than everyone else.  Reminds me of the university i went to..thank god i knew better!"
  },
  {
    "Tweet": " Blessed to receive an offer from The University of Vanderbilt.#gocommodores #blessed #allglory2god #vandy @psurtain23"
  },
  {
    "Tweet": " Rwanda is building its own Silicon Valley in partnership with Carnegie Mellon University. It is called Kigali Innovati"
  },
  {
    "Tweet": " TITANS WINIU South Bend continues the incredible start to their season with another conference win over Saint Ambrose Univ"
  },
  {
    "Tweet": " Thank you @S_Hodgin @HBBauserman for coming to visit me yesterday! More than blessed to receive an offer from Shenandoah Un"
  },
  {
    "Tweet": " Senate Confirms 49-44 Pro-Life Trump Nominee Sarah Pitlyk as Federal Judge: Pitlyk served as law clerk to Judge Brett Kavanaugh"
  },
  {
    "Tweet": "Florida four-year public university tuition and fees went from $4,137 in 2004-05 to $6,352 in 2019-20, the 26th largest increase among the 50 states and the District of Columbia, the College Board said ina new report. #sayfie "
  },
  {
    "Tweet": " The University of Miami can't escape a sex bias suit over allegations that a female professor was paid $25,000 less than her ma"
  },
  {
    "Tweet": " Honored &amp; Blessed to EARN my 1st offer from The University of Kentucky #BBN  "
  },
  {
    "Tweet": " Extremely blessed to receive my first D1 offer (PWO) to East Tennessee Dtae University @homeoftherebels @jabaridavis_VFL h"
  },
  {
    "Tweet": "@Mertzarkotr @sinanarinay @KurdishLobbyAus @__JoeAdams__ You are as phoney as a 9-dollar bill!Name just one university or high school or primary school where subjects are taught in Kurdish, just one! And Turks say they have no problem with their \"15-16 million Kurdish brothers\".Is Kurdish language terrorism?"
  },
  {
    "Tweet": " This story, which we ran Monday, had its officials announcement Wednesday. Looks to be completed in November 2021... Housing"
  },
  {
    "Tweet": "Excellence in global regulatory affairs at Northeastern University College of Professional Studies .....#lifelongexperientiallearninganywhere #humanics #globalnetwork "
  },
  {
    "Tweet": " BLESSED to receive a OFFER from Savannah State University!  #AGTG "
  },
  {
    "Tweet": " NEW: Retracing Steps at Beijing University, 1989-2019Philip J. Cunningham @jinpeili Cc: @jwassers h"
  },
  {
    "Tweet": " @atrupar They didn't teach science at Trump University."
  },
  {
    "Tweet": " Stanford, Harvard, and University of North Carolina not looking so good today...  #ImpeachmentInquiry"
  },
  {
    "Tweet": " This is unbelievable. The Jihadi shot dead on #LondonBridge was not only a convicted terrorist who had been released on a tag bu"
  },
  {
    "Tweet": " Really excited to be invited to speak to students at Yale University this weekend.  Service, Leadership....What will you"
  },
  {
    "Tweet": "@mmpadellan @FLOTUS What elite university professor came on national television in a sham impeachment hearing and mentioned Greta?"
  },
  {
    "Tweet": " @MsAvaArmstrong Actually I do see some good in these public farces.America is getting to see the useless deep state par"
  },
  {
    "Tweet": " @raikajiporo 3. Apparently, yes.4. I don't really think this film is about friendship. Personally, I see this as a film"
  },
  {
    "Tweet": " WATCH: \"If what we are talking about is not impeachable, then nothing is impeachable,\" Michael Gerhardt, a University of Nort"
  },
  {
    "Tweet": " University presidents are partnering with  investors to import more foreign workers for the jobs ne"
  },
  {
    "Tweet": "@asheborn57 This is living proof our college and university system is only a liberal indoctrination system. No wonder all the are creating now is a bunch of crybaby snowflakes"
  },
  {
    "Tweet": " I was hazed by Minister Stephen Lecce while I was pledging Sigma Chi at Western University and he was not only fraternity"
  },
  {
    "Tweet": " Members of the 1920 Gallaudet University football team. The first college for the deaf is credited with inventing the"
  },
  {
    "Tweet": " University mandem school uniform "
  },
  {
    "Tweet": " Blessed to receive an offer from Sam Houston State University  @DBCoachMcGraw "
  },
  {
    "Tweet": " Having taught university students for twenty years, I would say to parents, the most important thing you can teach your c"
  },
  {
    "Tweet": " Beyond thankful for the opportunity to play at the University of Colorado Boulder. Thank you @ReedHeim. #Relentless #Sk"
  },
  {
    "Tweet": " A week ago we found out ICE had a fake university to entrap students, steal their money and deport them, but we will b"
  },
  {
    "Tweet": "Blessed and thankful to receive an offer from Tiffin University!!! "
  },
  {
    "Tweet": "@charliekirk11 I'm a University Law Professor and Constitutional Scholar .. \"Orange Man Bad!\" "
  },
  {
    "Tweet": " This seems like a good opportunity for me to re-up this piece I wrote for @ArcDigi on why the right has soured entirely on un"
  },
  {
    "Tweet": "Graduate attributes/ skills are a critical part of most Australian universitys mission statements for teaching. Important for educators to link to these graduate attributes within individual courses and assessment. #RACIChemEd19 @RACI_ChemEd"
  },
  {
    "Tweet": " # Few ppl are giving theUniversity of Georgia aChance on Saturday. Keep up the positive vibes.L"
  },
  {
    "Tweet": " Blessed to have played for this University! #BoilerUp "
  },
  {
    "Tweet": " Blessed to receive a offer from Elizabeth city state university "
  },
  {
    "Tweet": "University of St. Thomas to layoff faculty, reorganize departments amid renewal "
  },
  {
    "Tweet": " Im pre-med and top 2% of my class at a large university. Try again. "
  },
  {
    "Tweet": "@markehayes @gbuck_jr He went to Trump University..."
  },
  {
    "Tweet": " After JNU, Now Aazadi Slogans Raised In DU: University Headed For Crisis As Thousands Of Teachers Go On StrikeModi govt"
  },
  {
    "Tweet": " Tonight I am teaching Marketing 571 at the University of Phoenix. In Workshop 5, we cover advertising. Students will create"
  },
  {
    "Tweet": "@AZweatherchick @CoconinoNF @NWSFlagstaff Heard those booms in University Heights in southwest #Flagstaff."
  },
  {
    "Tweet": "  The Little Cheerleader A KathNiel social serye where Sebastian, one of the universitys varsity player and top stud"
  },
  {
    "Tweet": "@davidfrum Is it an online school? Was it affiliated with Trump University?"
  },
  {
    "Tweet": "My favorite patch of fall leaves on campus.#fallleaves #ASU @tempegov @ Arizona State University-Tempe "
  },
  {
    "Tweet": "@DeplorableVandy @VandyFootball Disagree...think this is a good thing for ADMT. He can now show him, a unbiased opinion/view of how great athletics can be for a university!"
  },
  {
    "Tweet": " My bestfriend crossed at Troy University this weekend, so I thought yall should see a snippet of their probate. Rhoyal Reign"
  },
  {
    "Tweet": " Blessed to receive an offer from Ferris State University "
  },
  {
    "Tweet": " Beyond blessed and grateful to receive an opportunity to Further my education and football career at Shippensburg Universi"
  },
  {
    "Tweet": "@AhmedBaba_ No. They should go to Trump University..."
  },
  {
    "Tweet": " Harvard Universitys denial of tenure to the only Latina professor on track for the status sparks student protests and calls f"
  },
  {
    "Tweet": "Gracias a los compas de @lasantacecilia for educating the youngsters at @csuf #musicEducation #CSUF #LaSantaCecilia @ California State University, Fullerton "
  },
  {
    "Tweet": " Stanford, Harvard, and University of North Carolina not looking so good today...  #ImpeachmentInquiry"
  },
  {
    "Tweet": "@KevinMKruse I applied to Trump University School of Law.Waiting to hear!"
  },
  {
    "Tweet": "Send them to Trump University? "
  },
  {
    "Tweet": " Blessed to receive an official offer to the University of the Cumberlands. Thank you @CoachBrightUC and @UCPatriotFball  for"
  },
  {
    "Tweet": " Wow is #PamelaKarlan a bitter angry woman....and she is prostituting herself in front of her students, her university and th"
  },
  {
    "Tweet": " Last year I went on 5 holidays and next year I plan on going on 10I afforded it all on a part time wage whilst still on uni"
  },
  {
    "Tweet": "Excited to announce Ive received my 2nd offer from Aurora University! #GoSpartans "
  },
  {
    "Tweet": " Blessed to receive an offer from the University of the Cumberlands, thank you for the opportunity @CoachBrightUC @JCFB_Re"
  },
  {
    "Tweet": " Proud of @psanders_23 and all his accomplishments!! Today was a special day as he signed his NLI to play for Midwe"
  },
  {
    "Tweet": " My bestfriend crossed at Troy University this weekend, so I thought yall should see a snippet of their probate. Rhoyal Reign"
  },
  {
    "Tweet": " Really excited to be invited to speak to students at Yale University this weekend.  Service, Leadership....What will you"
  },
  {
    "Tweet": "WTF was that? Prof. Pamela S. Kartan flipped her cork. Totally OFF POINT, irresponsible, and improper to interject someone's child (who has NOTHING to do with anything IMPEACHMENT) into impeachment proceedings. THIS IS WHAT IS WRONG WITH OUR UNIVERSITY SYSTEM - "
  },
  {
    "Tweet": " Stanford, Harvard, and University of North Carolina not looking so good today...  #ImpeachmentInquiry"
  },
  {
    "Tweet": " Hello Harvard! You mean to say your $40 Billion endowment doesnt cover a decent workplace for student workers?I stand wi"
  },
  {
    "Tweet": " Blessed to receive an offer from Kentucky Christian University #GoKnights "
  },
  {
    "Tweet": " @USATODAY The lunatic left is despicable!Corrupt Democrats sink to another new low. Why the heck is ultra left liberal BIAS"
  },
  {
    "Tweet": "@WestWingReport As he totes his Trump University certificate of stupidity"
  },
  {
    "Tweet": " When I emigrated from Soviet Union to the West in 1998, I was enormously proud to get into the top University: Cambridge."
  },
  {
    "Tweet": " @cspan I used to think that Stanford was a well qualified University.  After watching Karland I have changed my opinion.  Sh"
  },
  {
    "Tweet": " Fun fact: Queen performed its first U.S. concert in Denver at Regis University in 1974  "
  },
  {
    "Tweet": " Dear Hindus, Don't get surprised. After Jihad Naxal Uloom (JNU), Dawood University (DU) under the nose of the so-call"
  },
  {
    "Tweet": " Senate Confirms 49-44 Pro-Life Trump Nominee Sarah Pitlyk as Federal Judge: Pitlyk served as law clerk to Judge Brett Kavanaugh"
  },
  {
    "Tweet": " Fucking amazing story from @rosalindzadams, who spent weeks on the ground in the chaos of Hong Kong's protests: Heres The Full S"
  },
  {
    "Tweet": " #AGTG I am very blessed to say that I have received an offer from The University of Southern California  #FightOn"
  },
  {
    "Tweet": " After a great talk with @CoachZCarney Im stocked to announce that Ive received my first Division 1 football offer from Val"
  },
  {
    "Tweet": "Check out Purdue University Boilermakers Blue Sweatshirt Briar Creek XXL #BriarCreek #Sweatshirt  via @eBay"
  },
  {
    "Tweet": "Alexander Cambitoglou, First Greek University Professor in Australia, Dies at 97 | Greek Reporter Australia "
  },
  {
    "Tweet": " Blessed to receive an offer to West Virginia State University "
  },
  {
    "Tweet": " We are excited to announce that Alison Willman has been accepted to Bellarmine University! Congratulations, Alison! @b"
  },
  {
    "Tweet": " Tonight I am teaching Marketing 571 at the University of Phoenix. In Workshop 5, we cover advertising. Students will create"
  },
  {
    "Tweet": " Big shout out to @xav1erharr1s on his commitment to University Of Montana. @GrizCoachGreen @MontanaGrizFB You guys are gett"
  },
  {
    "Tweet": " I was hazed by Minister Stephen Lecce while I was pledging Sigma Chi at Western University and he was not only fraternity"
  },
  {
    "Tweet": " .@FAMUAthletics AD Kortne Gosha discusses plans to fix the department's finances "
  },
  {
    "Tweet": " Members of the 1920 Gallaudet University football team. The first college for the deaf is credited with inventing the"
  },
  {
    "Tweet": " If anyone would like to call George Washington University and ask for Jonathan Turley termination call 202-994-1010 and"
  },
  {
    "Tweet": " Did you know University Education is free in:BrazilCzech RepublicFinlandFranceGermanyGreeceIcelandLuxembourgNorway"
  },
  {
    "Tweet": "You finished University or u be nurse so u wan marry unemployed graduate wey still dey live plus e  parents sake of love. Eeeei my sister, better go for som hardworking trotro driver ooo ."
  },
  {
    "Tweet": " JMU Nation, It has been an awesome ride playing and representing for this University! I have been fortunate these past"
  },
  {
    "Tweet": " wait- this decade is gonna be the decade we graduate university, buy a house, get a full-time job, have kids and get marr"
  },
  {
    "Tweet": " After a great talk with coach Olsen I would like to say that I received a offer from McNeese State University #AGTG #DBH"
  },
  {
    "Tweet": " Blessed to receive an offer from the university of Kentucky @MarshallMcDuf14 @Rivalsfbcamps @CoachP_SCA @BigCountyPrep"
  },
  {
    "Tweet": " Blessed to receive an offer from Harvard University!! #TTP @Coach_Joel_Lamb @TheCoachHo @HarvardFootball "
  },
  {
    "Tweet": "         In time past, we wereIn time future, we shall beThroughout the ages, we h"
  },
  {
    "Tweet": " Blessed to have EARNED my FIRST DIVISION ONE SCHOLARSHIP from MOREHEAD STATE UNIVERSITY  AGTA  @CoachBrins @JU"
  },
  {
    "Tweet": " @afualareine Oh this is personalI graduated from University My Grandma(bestfriend) diedStarted a career job In real esta"
  },
  {
    "Tweet": "@JWVerret Mr Verret.. Legal Scholar Im impressed.. I gather you have inside first hand knowledge of the call. Please feel free to share it.. Or, are you just the typical University ? that cant see past his own inbred bias towards the president .Opinions are fine but I prefer facts..."
  },
  {
    "Tweet": "@mkraju @JohnJHarwood Go to Trump University instead!! hahahahaha"
  },
  {
    "Tweet": " Senate Confirms 49-44 Pro-Life Trump Nominee Sarah Pitlyk as Federal Judge: Pitlyk served as law clerk to Judge Brett Kavanaugh"
  },
  {
    "Tweet": "We want Delhi University to be among the top in the world.With Ad-hoc-ism?#Delhi #University #Teachers #teachersstrike #highered #HigherEducation #DUTA"
  },
  {
    "Tweet": " My bestfriend crossed at Troy University this weekend, so I thought yall should see a snippet of their probate. Rhoyal Reign"
  },
  {
    "Tweet": " .@IEDCDubai signs cooperation agreement with the Islamic Economics Institute at King Abdul Aziz University in Saudi Ara"
  },
  {
    "Tweet": " Around 180,000 German citizens emigrate every year, while another 130,000 return. About 76% of emigrants have a university degr"
  },
  {
    "Tweet": "Bulldog Nation is extremely proud to announce that our AVID tutor, Xavier, will be graduating from the University of Houston with a Bachelors degree in Psychology!!! Thanks for being a positive role model for our students! #GoCoogs #Proud2BeCVISD "
  },
  {
    "Tweet": " Stanford University law professor Pamela Karlan said she felt \"insulted\" when Doug Collins (R-Ga.), a top Trump defender, que"
  },
  {
    "Tweet": " 2020 NFL Draft Prospect Interview: Maurice Wright Jr., LB, Northwestern Oklahoma State University "
  },
  {
    "Tweet": " Senate Confirms 49-44 Pro-Life Trump Nominee Sarah Pitlyk as Federal Judge: Pitlyk served as law clerk to Judge Brett Kavanaugh"
  },
  {
    "Tweet": " seungseok au where seungyoun and wooseoktwo aspiring lawyers are well known for being the university's tom &amp; jerry. littl"
  },
  {
    "Tweet": " # I guess she studied at a university in the UK. Don't you have good universities in your useless one-Ni"
  },
  {
    "Tweet": "@RiegerReport Better to run a fake university to scam people out of money, I suppose "
  },
  {
    "Tweet": " When you thought that Rat ate your last N1000 but no, it was just your University certificate. "
  },
  {
    "Tweet": " Wow is #PamelaKarlan a bitter angry woman....and she is prostituting herself in front of her students, her university and th"
  },
  {
    "Tweet": "@letsberealppl2 Honestly... SO THANKFUL to BAYLOR UNIVERSITY ...  My son is a thriving young man... who developed A TRUE CHRISTIAN CORE... &amp; THAT is what MATTERS the MOST"
  },
  {
    "Tweet": "@USC_mikebohn WOW.  What fired up responses.  As a UC season ticket holder (sorry to troll), when Huggins left...I told the Athletic Department that I was a season ticket holder of UC not the University of Huggins.  Coaches come and go...support the school !! Give @USC_mikebohn a chance."
  },
  {
    "Tweet": "I'm very excited to announce that I'll be starting in Fall 2020 as an assistant professor in the University of Illinois Urbana-Champaign Astronomy department! I'm looking forward to moving back to IL and for the new opportunities at UIUC!"
  },
  {
    "Tweet": " Excited to announce that I have received an offer from Texas State University! "
  },
  {
    "Tweet": " Harvard Universitys denial of tenure to the only Latina professor on track for the status sparks student protests and calls f"
  },
  {
    "Tweet": "@pfranklin51 @GMofCFB Actually, there has to be a reason for schools to rescind a scholarship. Usually it's because you didn't represent the university well or because you've been injured way too long to keep them on one (typically a coaches decision) or grades.There was a lot when I signed"
  },
  {
    "Tweet": " @mkraju ....but they can go to Trump University."
  },
  {
    "Tweet": " Thankful for this opportunity to get a free education, play football and provide for my family. ALL the hardwork &amp; dedi"
  },
  {
    "Tweet": " Congratulations to Cole Davis for signing his letter of intent to further his academic and golf career at the Universi"
  },
  {
    "Tweet": " Tonight I am teaching Marketing 571 at the University of Phoenix. In Workshop 5, we cover advertising. Students will create"
  },
  {
    "Tweet": " Blessed to receive an offer from West Virginia Wesleyan University #JUCOPRODUCT @DRRJuCoProspect @JuCoFootballACE "
  },
  {
    "Tweet": " Harvard Universitys denial of tenure to the only Latina professor on track for the status sparks student protests and calls f"
  },
  {
    "Tweet": " The @MT_Baseball schedule poster is FRESH!! Season is  72 days away!  @MTAthletics Get your season tickets @MT_tix !"
  },
  {
    "Tweet": " I will be signing December 18th to the University of Houston #GoCoogs"
  },
  {
    "Tweet": " Senate Confirms 49-44 Pro-Life Trump Nominee Sarah Pitlyk as Federal Judge: Pitlyk served as law clerk to Judge Brett Kavanaugh"
  },
  {
    "Tweet": "I've chatted with enough MAGAt's to know that this is not a big thing that they need to worry about. I doubt most of them could get into trump University. "
  },
  {
    "Tweet": " Harvard Universitys denial of tenure to the only Latina professor on track for the status sparks student protests and calls f"
  },
  {
    "Tweet": " Witnesses for Wednesday House Judiciary impeachment hearing: Noah Feldman"
  },
  {
    "Tweet": " The 2nd Japanese University To Run An XRPL Validator has gone live! Welcome to the  University of Tokyo #xrp @OneHanSolo @Dan"
  },
  {
    "Tweet": " As @UWMadison falls behind its peers as a research institution, former @WARF_News Managing Director Carl Gulbrandsen di"
  },
  {
    "Tweet": " Extremely BLESSED to receive my first FBS offer from Bowling Green State University!!!!  #FAMILY @BG_Football @Lo"
  },
  {
    "Tweet": " What this means, says Fortier, is that the role of the university is changing, expanding. Universities needs to help Canadian"
  },
  {
    "Tweet": " There's widespread flooding across San Diego as a powerful burst of showers hit the region -- including along the Universi"
  },
  {
    "Tweet": " 49 years ago, the Eta Psi Chapter of Delta Sigma Theta Sorority, Inc was chartered on the campus of Lamar University. Happy"
  },
  {
    "Tweet": ".@FAMUAthletics AD Kortne Gosha discusses plans to fix the department's finances "
  },
  {
    "Tweet": "@stikwithrik @washingtonpost You got nothing so you keep repeating yourself. I already gave you trump charity don't forget trump university."
  },
  {
    "Tweet": " Light On at Seminary Hall 2019 Thank you to Robyn Pursley, The College of Liberal Arts, Department of Drama, Miss NSU"
  },
  {
    "Tweet": "I'm seeking an internship in esports this summer. I'm a third year student at university and am eager to work hard. Please email me at sn789808@dal.ca if you know of any opportunities."
  },
  {
    "Tweet": " This woman is a deranged idiot who has no business being a professor to impressionable young minds at such a 'prestigious'"
  },
  {
    "Tweet": " 2020 NFL Draft Prospect Interview: Tajik Bagley, DB, Central Connecticut State University  #NFL #"
  },
  {
    "Tweet": " Call for submissions for the 2020 Southeast Asian American Studies Conference at San Jose State University. Submission"
  },
  {
    "Tweet": " Official offer from Grandview University #JUCOPRODUCT "
  },
  {
    "Tweet": " More than 150 students withdrew from a talk by former US Ambassador to Israel Daniel Kurtzers talk at the American Univers"
  },
  {
    "Tweet": " Really excited to be invited to speak to students at Yale University this weekend.  Service, Leadership....What will you"
  },
  {
    "Tweet": " Dr Bob Sears at #Vaccine Injury Event at the Capitol, #WashingtonDC.Dr Sears learnt through his practice that what he was t"
  },
  {
    "Tweet": " Juliana Chan, Professor of Medicine and Therapeutics, Faculty of Medicine at The Chinese University of Hong Kong, on th"
  },
  {
    "Tweet": " @BillKristol If I was a law student at George Washington University, I would transfer to another school."
  },
  {
    "Tweet": "@USATODAY Ones a constitutional law professor from Stanford and the other is a third rate East European ex-model who claims to have graduated from a university that doesnt exist, posed nude and slept her way to a higher and higher social status. "
  },
  {
    "Tweet": "[NCAAM] Boston University is leading George Washington 35 to 28, HALF."
  },
  {
    "Tweet": "BlessedOffer #6 Concordia university chicago  @1coachp @CoachWatkinsCUC @ShadesValleyFB "
  },
  {
    "Tweet": " Harvard Universitys denial of tenure to the only Latina professor on track for the status sparks student protests and calls f"
  },
  {
    "Tweet": " \"We are living in the very period described by Alexander Hamilton. A period of agitated passions...That is why this is wro"
  },
  {
    "Tweet": " ADMISSION INTO PHILIPPINE UNIVERSITIES.Ever tired of disappointment of getting into university in nigeria?Ever tired o"
  },
  {
    "Tweet": " @mkraju @medit8now When Mr. Gohmert needs a lawyer I'm sure he'll look for a graduate from tRump University."
  },
  {
    "Tweet": " Tonight I am teaching Marketing 571 at the University of Phoenix. In Workshop 5, we cover advertising. Students will create"
  },
  {
    "Tweet": " Blessed to receive an official offer from Grand View University !! @CoachSWalters @awoodley "
  },
  {
    "Tweet": "@ShaiDeLuca None of this means that antisemitism isnt happening on campus. It means its not *endemic* to university campuses like how its talked about."
  },
  {
    "Tweet": " I am Very BLESSED to say I have received an offer from The University of Southern Mississippi   @coachcbuckner @G_Pai"
  },
  {
    "Tweet": "@USC_mikebohn If you're cool with mediocrity, then you saved me a lot of stress of worrying about this team being an elite program again. Hope it's worth the university saving $$$ on Helton's buyout for all the money they're going to lose with an apathetic fanbase to match the apathetic admin."
  },
  {
    "Tweet": " Every day...Every damn day..#StopTheMadness#OneVoice1Active Shooter Reported Jackson State University On Lockdown Wednesday"
  },
  {
    "Tweet": "Former Cyclone Jordyn Keck will continue her basketball career at Colorado State University-Pueblo "
  },
  {
    "Tweet": " Yesterday, I sent a letter to FL university presidents requesting info on the steps taken to safeguard Americans tech &amp;"
  },
  {
    "Tweet": " Blessed to receive a PWO from Furman University!! @Coach_Lane8 @coachmiller2525 @gwquarles @ShaedonMeadors @coach_ashmore @"
  },
  {
    "Tweet": "Lighting of the Commons @ Oklahoma Christian University "
  },
  {
    "Tweet": " My bestfriend crossed at Troy University this weekend, so I thought yall should see a snippet of their probate. Rhoyal Reign"
  },
  {
    "Tweet": " Blessed to have received an offer from University Of Illinois Springfield! "
  },
  {
    "Tweet": " I am beyond blessed and honored to announce I am committing to play baseball at the University of Arkansas-Little Rock. Thank"
  },
  {
    "Tweet": " Did you know University Education is free in:BrazilCzech RepublicFinlandFranceGermanyGreeceIcelandLuxembourgNorway"
  },
  {
    "Tweet": " Harvard Universitys denial of tenure to the only Latina professor on track for the status sparks student protests and calls f"
  },
  {
    "Tweet": "Yesterday's sexual violence town hall came after significant criticism on Universitys handling of sexual violence on campus "
  },
  {
    "Tweet": "- @MargRiosFarjat \"She was born in Monterrey, Nuevo Le Rwas a Professor in Tax Law. She earned her Ph.D. in public policy from the Autonomous University of Nuevo Le In the past, she has worked in editorialist on economic issues in the Newspaper El Norte.\""
  },
  {
    "Tweet": "14-year-old D.C. student starts his first day at George Washington University "
  },
  {
    "Tweet": "Racist University Employee Told Minority Students to Avoid Bringing White People Into Dorms "
  },
  {
    "Tweet": " Beyond thankful for the opportunity to play at the University of Colorado Boulder. Thank you @ReedHeim. #Relentless #Sk"
  },
  {
    "Tweet": " Blessed to receive an offer from St. Andrews University!! @YorkRecruits @Coach_AjHopke @YorkCougars "
  },
  {
    "Tweet": " Blessed To Receive A Offer From University Of Tennesese Martin @coach_mac98 @CuttemUp #UTM2020 "
  },
  {
    "Tweet": " @StanfordLaw and @Stanford support their professors to slam the Presidents 13 year old son to prove her hate for the President"
  },
  {
    "Tweet": "@JohnJHarwood What school gets credit for Gohmerts education? Is he a Trump university graduate?"
  },
  {
    "Tweet": " After a great talk with @CoachBrightUC Im very blessed to receive an offer from University of the Cumberlands @CSmithScou"
  },
  {
    "Tweet": "I have a weird fetish of driving thru college campuses. Anytime I go to a new city I wanna find out where their biggest university is and go see it"
  },
  {
    "Tweet": "Some stress in early life extends lifespan -- ScienceDaily  Some stress at a young age could actually lead to a longer life, new research shows.University of Michigan researchers have... "
  },
  {
    "Tweet": " Oxford Yellow Jackets (13-1)vs.Spanish Fort Toros (9-5) Friday December 6th 7 p.m. CST Auburn University  Jordan"
  },
  {
    "Tweet": " JMU Nation, It has been an awesome ride playing and representing for this University! I have been fortunate these past"
  },
  {
    "Tweet": "@bbcnickrobinson To paraphrase Noam Chomsky, if Nick Robinson hadn't been President of the Oxford University Conservative Association, he wouldn't be presenting #r4today. The establishment bias is built into the system."
  },
  {
    "Tweet": " Members of the 1920 Gallaudet University football team. The first college for the deaf is credited with inventing the"
  },
  {
    "Tweet": " Harvard Universitys denial of tenure to the only Latina professor on track for the status sparks student protests and calls f"
  },
  {
    "Tweet": "@TimRichardsTN @clayphillips27 @VandyAD This could also read, that ADMT has all the tools to make him understand how great athletics can be for a university, since hes never been around it. He doesnt necessarily think athletics are bad just is accustomed to them being around. Hence, why ADMT will be able to do what.."
  },
  {
    "Tweet": " Hello Harvard! You mean to say your $40 Billion endowment doesnt cover a decent workplace for student workers?I stand wi"
  },
  {
    "Tweet": " Rwanda is building its own Silicon Valley in partnership with Carnegie Mellon University. It is called Kigali Innovati"
  },
  {
    "Tweet": "An university student just end his life in Hungary, because of bad grades from the tests. I think he felt his situation hopeless, that's why he did it. I'm feel sorry for him, and don't forget, life will continue, even if you have bad grades or you can't do it.Rest in peace."
  },
  {
    "Tweet": " Special Thanks to Coach McMenamin from East Stroudsburg University for stopping by VHS! @franmc_73 "
  },
  {
    "Tweet": "@KevinMKruse I guess they think Trump University is the bees knees...."
  },
  {
    "Tweet": " We're delighted to hear @Columbia University is offering a scholarship for refugees and displaced people.Only 3% of the wor"
  },
  {
    "Tweet": " If anyone would like to call George Washington University and ask for Jonathan Turley termination call 202-994-1010 and"
  },
  {
    "Tweet": " Do I have any Canadian friends on here? If so, check this thread on the upper class British antisemitic conspiracy the"
  },
  {
    "Tweet": " Blessed &amp; Excited to receive my 1st offer from Jacksonville State University #StayCocky  @CoachKSigler  @JSUGamecocksFB"
  },
  {
    "Tweet": " Senate Confirms 49-44 Pro-Life Trump Nominee Sarah Pitlyk as Federal Judge: Pitlyk served as law clerk to Judge Brett Kavanaugh"
  },
  {
    "Tweet": " If anyone would like to call George Washington University and ask for Jonathan Turley termination call 202-994-1010 and"
  },
  {
    "Tweet": " Yes, because who wants to attend a world-class university? "
  },
  {
    "Tweet": " Community college is the move. Take the first 2 years of classes for a lot cheaper or even free compared to a university ht"
  },
  {
    "Tweet": " Congratulations to Norths Caitlin Corso as she committed today to run track and cross country at Eastern Illinois Universi"
  },
  {
    "Tweet": " \"Gut public subsidy &amp; the elite colleges &amp; universities where much of the trouble happens will probably be fine. But the stat"
  },
  {
    "Tweet": " Senate Confirms 49-44 Pro-Life Trump Nominee Sarah Pitlyk as Federal Judge: Pitlyk served as law clerk to Judge Brett Kavanaugh"
  },
  {
    "Tweet": " Extremely blessed to receive a PWO from East Tennessee State University! "
  },
  {
    "Tweet": " #AGTG I am very blessed to say that I have received an offer from The University of Southern California  #FightOn"
  },
  {
    "Tweet": " split model attraction is NOT a thing and is highly problematic, Tumblr University lied to yall"
  },
  {
    "Tweet": " Blessed to receive an offer from Lyon University @CoachKent41 "
  },
  {
    "Tweet": " In fact, I am the College of Friendship;The University of Brotherly Love;The School for the Better Making of Men.I AM ALPH"
  },
  {
    "Tweet": " Last year I went on 5 holidays and next year I plan on going on 10I afforded it all on a part time wage whilst still on uni"
  },
  {
    "Tweet": "14-year-old D.C. student starts his first day at George Washington University "
  },
  {
    "Tweet": "4 years in university and I've seen people crying in washrooms, library, sports complex &amp; every other corner of that place. University is cruel. The snake culture, sick teachers, family problems, gpa &amp; anxiety for future take away all of ur charm &amp; kill your will to live. Sad."
  },
  {
    "Tweet": " When I emigrated from Soviet Union to the West in 1998, I was enormously proud to get into the top University: Cambridge."
  },
  {
    "Tweet": " After a great talk with @Coach_AjHopke I am blessed to say Ive received my second offer from St. Andrews University!!  @H"
  },
  {
    "Tweet": " After a great talk with @Coach68Hinojos I am blessed to receive my first official offer from Wayland Baptist university"
  },
  {
    "Tweet": " After a great talk with @KU_EJones , Im blessed to say that Ive received my second POWER 5 offer from the University"
  },
  {
    "Tweet": " It was a lot of hard work but well worth it. The hard work certainly paid off for Joshua as his grades were amongst th"
  },
  {
    "Tweet": " Senate Confirms 49-44 Pro-Life Trump Nominee Sarah Pitlyk as Federal Judge: Pitlyk served as law clerk to Judge Brett Kavanaugh"
  },
  {
    "Tweet": "Blessed to receive an offer from the University of the Cumberlands, thank you for the opportunity @CoachBrightUC @JCFB_Recruiting @AL7AFootball "
  },
  {
    "Tweet": " A #Peking University Photo Album: #snow-covered ground, trees, buildings, and sculptures. Snow creates such a magical effect,"
  },
  {
    "Tweet": " During the Popeyes chicken craze discourse so many ppl incorrectly said blk ppl dont patronize blk businesses similarly, whi"
  },
  {
    "Tweet": " 2020 NFL Draft Prospect Interview: Tajik Bagley, DB, Central Connecticut State University  #NFL #"
  },
  {
    "Tweet": " WATCH: \"If what we are talking about is not impeachable, then nothing is impeachable,\" Michael Gerhardt, a University of Nort"
  },
  {
    "Tweet": " My mom told me that she payed a total of $2,500 for her masters degree from Auburn University in 1986. Then she said, I pa"
  },
  {
    "Tweet": " Our signature list has more than doubled in 24 hours! The chorus of voices advocating for @Lane_Kiffin to be our next hea"
  },
  {
    "Tweet": " I am THRILLED to announce I will be graduating with a Bachelors of Arts in Music from the University of Southern Mississipp"
  },
  {
    "Tweet": " Huge thanks to @KU_EJones and Kansas University for my first football offer! "
  },
  {
    "Tweet": " Thankful to receive an offer to play football at Valparaiso University @Coach__Robinson @valpoufootball "
  },
  {
    "Tweet": " Huntington University Announces Strauss Animal Center:  "
  },
  {
    "Tweet": " Rwanda is building its own Silicon Valley in partnership with Carnegie Mellon University. It is called Kigali Innovati"
  },
  {
    "Tweet": "@RiegerReport Thats stupid cause its hard to get in I would be Proud for my children to be at Harvard University"
  },
  {
    "Tweet": " Tonight I am teaching Marketing 571 at the University of Phoenix. In Workshop 5, we cover advertising. Students will create"
  },
  {
    "Tweet": " Blessed to receive an offer from Louisiana Tech University! @CoachBlakeBryan @TVCCFOOTBALL @CoachBGamble @JuCoFootballACE "
  },
  {
    "Tweet": " Oseola McCarty worked all her life cleaning other women's houses. She lived very frugally, and from her savings, donat"
  },
  {
    "Tweet": " Stanford, Harvard, and University of North Carolina not looking so good today...  #ImpeachmentInquiry"
  },
  {
    "Tweet": " If anyone would like to call George Washington University and ask for Jonathan Turley termination call 202-994-1010 and"
  },
  {
    "Tweet": "Melody Wilson, President of the University Staff Advisory Council (USAC), welcoming and thanking attendees at the USAC 20th Anniversary Celebration. @ University of Richmond "
  },
  {
    "Tweet": "Professor Colleen Murrell presents the current crisis in journalism on the #jeraa2019 at the University of Sydney"
  },
  {
    "Tweet": "Yes, because who wants to attend a world-class university? "
  },
  {
    "Tweet": " Stanford, Harvard, and University of North Carolina not looking so good today...  #ImpeachmentInquiry"
  },
  {
    "Tweet": " Founders day mood from Knuck University also known as @ThetaMuAlphas PS: That young man with the slow-mo live  "
  },
  {
    "Tweet": " NUMBERS. There are 125 FCS teams nationwide. There are only 16 teams still in the playoffs. There is only 1 private scho"
  },
  {
    "Tweet": " I was hazed by Minister Stephen Lecce while I was pledging Sigma Chi at Western University and he was not only fraternity"
  },
  {
    "Tweet": " An interesting insight we gain through a detailed perusal of Vamiki Ramayana: Different types of aircrafts were in u"
  },
  {
    "Tweet": "1. running from the facts to point out grammar = hilarious 2. I don't represent this country, sadly Trump does 3. Im sad you resorted to assumption, i actually went to catholic school and university 4. You're grammar correcting someone on Twitter... think about it "
  },
  {
    "Tweet": "The one witness Republicans were permitted to call was Jonathan Turley, a professor at the George Washington University Law School."
  },
  {
    "Tweet": " God has been so good to me in my football career! I wanna thank my Family, Coaches, Teammates, and God for this opportu"
  },
  {
    "Tweet": " Congratulations to @OtteryStMaryCC u15s who won the Exeter University Indoor Cricket League after a seven week series"
  },
  {
    "Tweet": "Noah R. Feldman, a Harvard Law School professor, worked for Hillary Clintons 2016 election campaign, and Michael J. Gerhardt, a professor of constitutional law at the University of North Carolina at Chapel Hill, wrote up President Bill Clintons judicial selection policy."
  },
  {
    "Tweet": " [Updated] Statement: Hong Kong Watch and Baroness Bennett call for urgent intervention to end siege of Hong Kongs Polytechni"
  },
  {
    "Tweet": "@neilwalkerwrote Grand Magician Alexis Darn is a sassy little shit. Fortunately for him he's way too powerful and scary for anybody to call him out on it. Until an eleven-year-old orphan with blue magic comes along and is a little shit back. This is how families are made! "
  },
  {
    "Tweet": "Harvard Universitys denial of tenure to the only Latina professor on track for the status sparks student protests and calls from academic communities for the decision to be reversed. "
  },
  {
    "Tweet": "The evil professor from Stanford University  "
  },
  {
    "Tweet": "Dont forget about the university pack giveaway! We'll be doing tours and drawing a winner on Monday the 9th! "
  },
  {
    "Tweet": " Did you know University Education is free in:BrazilCzech RepublicFinlandFranceGermanyGreeceIcelandLuxembourgNorway"
  },
  {
    "Tweet": " One of the first meanings had to do with abolition, but its a meaning that didnt stick, Edward Berenson, a history pr"
  },
  {
    "Tweet": "@RiegerReport Uhh, whats next retraining camps for all university profs?"
  },
  {
    "Tweet": "@Coach_Odom Thanks for all you have done for the university. You are a class act guy. Wish you nothing but success in your next adventure. I'm sure you will be on the sideline again in no time."
  },
  {
    "Tweet": "@ybweaver @mrslape Waynesburg University this was awesome! #serviceleadershipandteaching"
  },
  {
    "Tweet": " Blessed To Receive Another Division 1 offer from Sacred Heart University #WeAreSHU @Coach_Cooke52 "
  },
  {
    "Tweet": " After a great home visit with Head Coach Nielsen and Coach Paopao, I would like to announce my commitment to the UNIVERSI"
  },
  {
    "Tweet": "The full story of the Hong Kong protests, and how a university fell under siege and went to war with police  from @rosalindzadams"
  },
  {
    "Tweet": "Yes @Stanford @StanfordLaw - this professor represents the university! She should be removed!  Not just her uncalled for attack on a minor, but her hate filled bias and poor interpretation of our constitution! "
  },
  {
    "Tweet": " Wonderful news!! Go @arlanwashere!! #rolemodel Oxford University launches scholarship scheme for black Britons  "
  },
  {
    "Tweet": " Great thread discussing the recent ICE sting operation at the University of Farmington from an Indian national. Will @AO"
  },
  {
    "Tweet": " University Of Florida Official Visit this weekend  #GatorGangXX"
  },
  {
    "Tweet": " Im very thankful and happy to say I have received my 3rd D1 offer from Northern Arizona University. Thank you @E_Thompson92"
  },
  {
    "Tweet": " Honored to receive a PWO from North Carolina Central University! Thank you @CoachJUANN "
  },
  {
    "Tweet": "Happy founders day to my guys @dblcuppedwater @_StretchTheKidd @bigfish1906 &amp; the #BetaMu chapter of Kentucky State University!!"
  },
  {
    "Tweet": " If anyone would like to call George Washington University and ask for Jonathan Turley termination call 202-994-1010 and"
  },
  {
    "Tweet": "\"Gut public subsidy &amp; the elite colleges &amp; universities where much of the trouble happens will probably be fine. But the state schools, community colleges, &amp; regional centers of education for folks who arent rich or upper middle class will suffer for it.\" "
  },
  {
    "Tweet": " @mkraju @medit8now When Mr. Gohmert needs a lawyer I'm sure he'll look for a graduate from tRump University."
  },
  {
    "Tweet": "Tonight I am teaching Marketing 571 at the University of Phoenix. In Workshop 5, we cover advertising. Students will create ad copy (text) for a familiar brand, and discuss how to place ads in different media. #marketing #advertising #advertise #ads #ad #deantripodes "
  },
  {
    "Tweet": " I will be signing December 18th to the University of Houston #GoCoogs"
  },
  {
    "Tweet": " The University of Kansas @KUHoops  was in the gym this afternoon, attending our high school team's practice. We appreciate"
  },
  {
    "Tweet": " I was hazed by Minister Stephen Lecce while I was pledging Sigma Chi at Western University and he was not only fraternity"
  },
  {
    "Tweet": "@SeekerOTL @JonathanFC229 The University and Graduate systems need to be reviewed for Political CORRUPTION.  I don't see @Potus addressing this deep state recruiting funnel and CFR Conduit.  @DanScavino  Harvard, Columbia, loyola all of which Obama attended and no one knew him. AMER. U and Stanford too "
  },
  {
    "Tweet": " So excited to recieve my first offer to play college football at Shenandoah University #GoHornets Thanks @CoachMitch_4 @"
  },
  {
    "Tweet": " Hello Harvard! You mean to say your $40 Billion endowment doesnt cover a decent workplace for student workers?I stand wi"
  },
  {
    "Tweet": "Monsters University is NOTHING like college. Completely false advertising. Im dropping out."
  },
  {
    "Tweet": " Did you know University Education is free in:BrazilCzech RepublicFinlandFranceGermanyGreeceIcelandLuxembourgNorway"
  },
  {
    "Tweet": " A week ago we found out ICE had a fake university to entrap students, steal their money and deport them, but we will b"
  },
  {
    "Tweet": "Stanford University folks have to be really disgusted tonight. Disgusted and embarrassed."
  },
  {
    "Tweet": " After Fridays visit Im very honored and excited to announce that I am officially Committed to the University of Nebr"
  },
  {
    "Tweet": " Amornchai Laohapongchana  Chulalongkorn University  Because We Can Only Use Lines Just To "
  },
  {
    "Tweet": " \"If you believe Donald Trump cares about corruption anywhere, I have a certificate from Trump University to sell you. This"
  },
  {
    "Tweet": " Skills and Entrepreneurship Bill has been passed in the @DelhiAssembly.\"This initiative will explore new possibilities"
  },
  {
    "Tweet": " Over the past couple weeks I spent time at #CUHK and #PolyU as universities turned into fortresses in Hong Kong and som"
  },
  {
    "Tweet": "Far and away my favorite sports teams, ranked by preference:- The Texas Christian University Horned Frogs--"
  },
  {
    "Tweet": " This woman is a deranged idiot who has no business being a professor to impressionable young minds at such a 'prestigious'"
  },
  {
    "Tweet": " Did you know University Education is free in:BrazilCzech RepublicFinlandFranceGermanyGreeceIcelandLuxembourgNorway"
  },
  {
    "Tweet": "December 4th School Attack Anniversary: 2009 Vestal, NY; Richard T. Antoun, 77, a professor of anthropology, was stabbed to death at Binghamton University. Police arrested 46-year-old graduate student from Saudi Arabia. #NeverAgain @MomsDemand @Everytown"
  },
  {
    "Tweet": " A tribute to this great state and university. Death Valley, where opponents dreams come to die... but where mine came tru"
  },
  {
    "Tweet": " Yesterday, I sent a letter to FL university presidents requesting info on the steps taken to safeguard Americans tech &amp;"
  },
  {
    "Tweet": "Just got approved for the Direct Funding Ontario program.Looking for someone interested in work as a personal attendant (doesnt have to be a PSW), could be a college/university student, evenings &amp; weekends in Etobicoke.  "
  }
]